# Используем официальный образ Node.js в качестве базового образа
FROM node:14

# Установка рабочей директории внутри контейнера
WORKDIR /app

# Копирование зависимостей и файла package.json/package-lock.json
COPY package*.json ./

# Установка зависимостей
RUN npm install

# Копирование всех файлов из текущей директории внутрь контейнера
COPY . .

# Сборка проекта Vue.js
RUN npm run build

# Указываем, какой порт будет слушать приложение
EXPOSE 8080

# Команда для запуска приложения
CMD ["npm", "run", "serve"]